'use strict';

const COLS = 10; // количество колонок (количество блоков в длину)
const ROWS = 20; // количество строк
const LINES_PER_LEVEL = 10; //количество линий для повышения уровня

// поправки на размер игрового поля в зависимости от ширины окна
if (document.body.offsetWidth < 850) {
  var BLOCK_SIZE = 20; // размер оного блока
} else if (document.body.offsetWidth < 700) {
    var BLOCK_SIZE = 10;
  } else {
      var BLOCK_SIZE = 30;
    }

    // цвета фигурок тетриса
const COLORS = [
  'none',
  'cyan',
  'blue',
  'orange',
  'yellow',
  'green',
  'purple',
  'red'
];
Object.freeze(COLORS); // предотвращаем добавление новых свойств к объекту (COLORS)

// фигуры тетриса
const SHAPES = [
  [],
  [[0, 0, 0, 0], 
   [1, 1, 1, 1], 
   [0, 0, 0, 0], 
   [0, 0, 0, 0]],

  [[2, 0, 0], 
   [2, 2, 2], 
   [0, 0, 0]],

  [[0, 0, 3], 
   [3, 3, 3], 
   [0, 0, 0]],

  [[4, 4], 
   [4, 4]],

  [[0, 5, 5], 
   [5, 5, 0], 
   [0, 0, 0]],

  [[0, 6, 0], 
   [6, 6, 6], 
   [0, 0, 0]],

  [[7, 7, 0], 
   [0, 7, 7], 
   [0, 0, 0]]
];
Object.freeze(SHAPES); // предотвращаем добавление новых свойств к объекту (SHAPES)

// код клавиши клавиатуры
const KEY = {
  ESC: 27,
  SPACE: 32,
  LEFT: 37,
  UP: 38,
  RIGHT: 39,
  DOWN: 40,
  P: 80
}
Object.freeze(KEY); // предотвращаем добавление новых свойств к объекту (KEY)

// количество очков за очищение строк и за самостоятельное опускание фигуры тетриса
const POINTS = {
  SINGLE: 100,
  DOUBLE: 300,
  TRIPLE: 500,
  TETRIS: 800,
  SOFT_DROP: 1,
  HARD_DROP: 2,
}
Object.freeze(POINTS); // предотвращаем добавление новых свойств к объекту (POINTS)

const LEVEL = {
  0: 800,
  1: 720,
  2: 630,
  3: 550,
  4: 470,
  5: 380,
  6: 300,
  7: 220,
  8: 130,
  9: 100,
  10: 80,
  11: 80,
  12: 80,
  13: 70,
  14: 70,
  15: 70,
  16: 50,
  17: 50,
  18: 50,
  19: 30,
  20: 30,
  
}
Object.freeze(LEVEL); // предотвращаем добавление новых свойств к объекту (LEVEL)
